clc
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%层次分析法对于旅游目的地选择程序，2018年7月24日，张立溥
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
A=[1,2,1/2;1/2,1,1/3;2,3,1];
[Am,An]=size(A);
[Avec,Ala]=eig(A);%Avec特征向量，Ala特征值
[Ala_max,Ai]=max(diag(Ala));%找出最大特征zhiAla_max及其所在的列Ai
Avec=Avec(:,Ai)/sum(Avec(:,Ai));%归一化处理最大特征向量
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%验证归一化的最大特征向量能否作为权重
% A*Avec-max(diag(Ala))*Avec%%%%%%%%%%%%%验证特征值和特征向量之间的关系
ACI=(Ala_max-An)/(An-1);%计算一致性指标
RI=[0,0,0.58,0.90,1.12,1.24,1.32,1.41,1.45,1.49,1.51];%随机一致性指标RI的数值
ACR=ACI/RI(An);%计算一致性比率CR,当比率小于0.1时，认为不一致程度在容许范围以内
%本题CR为0.016，因此可以接受。即归一化处理最大特征向量可以做为权重。
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%组合权向量
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
B1=[1,3,1/2;1/3,1,1/5;2,5,1];%方案层对价格的成对比较矩阵
B2=[1,1/4,1/2;4,1,2;2,1/2,1];%方案层对外观的成对比较矩阵
B3=[1,1/2,1/3;2,1,1/2;3,2,1];%方案层对性能的成对比较矩阵
[Bm,Bn]=size(B1);%矩阵B的行列数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%计算特征向量和特征值，寻找最大特征值，并做出归一化的特征向量
[B1vec,B1la]=eig(B1);%B1特征向量，B1特征值
[B2vec,B2la]=eig(B2);%B2特征向量，B2特征值
[B3vec,B3la]=eig(B3);%B3特征向量，B3特征值
[B1la_max,B1i]=max(diag(B1la));%找出最大特征值B1la_max及其所在的列B1i
[B2la_max,B2i]=max(diag(B2la));%找出最大特征值B1la_max及其所在的列B1i
[B3la_max,B3i]=max(diag(B3la));%找出最大特征值B1la_max及其所在的列B1i
B1vec=B1vec(:,B1i)/sum(B1vec(:,B1i));%归一化处理最大特征向量
B2vec=B2vec(:,B2i)/sum(B2vec(:,B2i));%归一化处理最大特征向量
B3vec=B3vec(:,B3i)/sum(B3vec(:,B3i));%归一化处理最大特征向量
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
B12345=[B1vec,B2vec,B3vec];%全体归一化后五个矩阵的特征向量
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
B1CI=(B1la_max-Bn)/(Bn-1);%计算B1一致性指标
B2CI=(B2la_max-Bn)/(Bn-1);%计算B2一致性指标
B3CI=(B3la_max-Bn)/(Bn-1);%计算B3一致性指标
%前三行为各自归一后最大特征向量，第四行为各自最大特征值，第五行为一致性指标
BCI=[B12345;B1la_max,B2la_max,B3la_max
    B1CI,B2CI,B3CI];
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% %计算组合权向量
% %由第二层的
w=BCI(1:3,:)*Avec
% %经比较可以算出权重大的为目的地